---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingCurvesCrossAxis
source: html/1e602e50-1aca-c8e4-301b-031c6c466139.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingCurvesCrossAxis Property

The highlighted curves cross the axis.

## Syntax (C#)
```csharp
public static FailureDefinitionId SculptingCurvesCrossAxis { get; }
```